[
    {
        "slug": "modification_history",
        "label": "Modification History",
        "children": [
            "<table><tr><td><p><strong>Release</strong></p></td><td><p><strong>Comments</strong></p></td></tr><tr><td><p>Release 1</p></td><td><p>This version first released with CUA Creative Arts and Culture Training Package Version 5.0.</p></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "application",
        "label": "Application",
        "children": [
            "<p>This unit describes the skills and knowledge required to source, apply and update general knowledge of the design industry based on problem solving, aesthetics, materials and processes appropriately used within the design industry. It involves researching information on different features of the industry, applying it to one’s own work practice, and remaining up-to-date on industry practices. </p>",
            "<p>It applies to individuals who work under supervision and support the professional design process such as evaluating the nature of design.</p>",
            "<p>No licensing, legislative or certification requirements apply to this unit at the time of publication.</p>"
        ]
    },
    {
        "slug": "unit_sector",
        "label": "Unit Sector",
        "children": [
            "<p>Design – Design Process</p>"
        ]
    },
    {
        "slug": "elements_and_performance_criteria",
        "label": "Elements and Performance Criteria",
        "children": [
            "<table><tr><td><p><strong>ELEMENT</strong></p></td><td><p><strong>PERFORMANCE CRITERIA</strong></p></td></tr><tr><td><p><em>Elements describe the essential outcomes.</em></p></td><td><p><em>Performance criteria describe the performance needed to demonstrate achievement of the element.</em></p></td></tr><tr><td><p>1. Source and apply information on the structure and operation of design industry</p></td><td><p>1.1 Identify and analyse information on the design industry and professional design practice  </p><p>1.2 Inform own design practice and work using knowledge of the design industry</p><p>1.3 Obtain information on employment obligations and opportunities in the design industry </p><p>1.4 Apply knowledge of employment obligations and opportunities within day-to-day work activities</p></td></tr><tr><td><p>2. Seek information on new design technology</p></td><td><p>2.1 Identify sources of information on new technology affecting different areas of design practice</p><p>2.2 Investigate applicable technologies to assist required work performance </p></td></tr><tr><td><p>3. Update industry knowledge</p></td><td><p>3.1 Identify and use opportunities to update knowledge of the design industry and monitor current issues of concern to the industry</p><p>3.2 Share updated knowledge with colleagues and peer group as required, and incorporate into day-to-day work activities </p></td></tr><tr><td><p>4. Apply information on ethical and legal work practices</p></td><td><p>4.1 Source information on ethical and legal work practices in the context of design  </p><p>4.2 Share updated knowledge on ethical and legal work practice in day-to-day work activities  </p></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "foundation_skills",
        "label": "Foundation Skills",
        "children": [
            "<p><em>This section describes those language, literacy, numeracy and employment skills that are essential to performance but not explicit in the performance criteria.</em></p>",
            "<table><tr><td><p><strong>S</strong><strong>KILL</strong></p></td><td><p><strong>DESCRIPTION</strong></p></td></tr><tr><td><p>Reading</p></td><td><ul><li>Evaluates different texts to determine legislative and regulatory requirements, and current industry practices </li></ul></td></tr><tr><td><p>Writing</p></td><td><ul><li>Produces different text types using applicable vocabulary, grammatical structure and referencing conventions </li></ul></td></tr><tr><td><p>Oral Communication</p></td><td><ul><li>Presents information using vocabulary, style and tone appropriate to audience </li></ul></td></tr><tr><td><p>Numeracy</p></td><td><ul><li>Identifies and comprehends numerical information in different familiar texts</li></ul></td></tr><tr><td><p>Self-management</p></td><td><ul><li>Takes some personal responsibility for adherence to legal, ethical and regulatory requirements</li><li>Takes responsibility for routine low-impact decisions within familiar situations</li></ul></td></tr><tr><td><p>Planning and organising</p></td><td><ul><li>Plans and organises required tasks  </li><li>Contributes to design of new approaches within immediate work environment</li></ul></td></tr><tr><td><p>Technology</p></td><td><ul><li>Completes routine tasks using common digital systems and tools</li></ul></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "unit_mapping_information",
        "label": "Unit Mapping Information",
        "children": [
            "<p>Supersedes and is equivalent to BSBDES304 Source and apply design industry knowledge. </p>"
        ]
    },
    {
        "slug": "links",
        "label": "Links",
        "children": [
            "<p>Companion Volume Implementation Guide is found on VETNet - <a>https://vetnet.gov.au/Pages/TrainingDocs.aspx?q=1db201d9-4006-4430-839f-382ef6b803d5</a></p>"
        ]
    },
    {
        "slug": "modification_history",
        "label": "Modification History",
        "children": [
            "<table><tr><td><p><strong>Release</strong></p></td><td><p><strong>Comments</strong></p></td></tr><tr><td><p>Release 1</p></td><td><p>This version first released with CUA Creative Arts and Culture Training Package Version 5.0.</p></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "performance_evidence",
        "label": "Performance Evidence",
        "children": [
            "<p>The candidate must demonstrate the ability to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including evidence of the ability to:</p>",
            "<ul><li>identify the following for working in the design industry and its application to own work:</li></ul>",
            "<ul><li>employment obligations and opportunities</li><li>new technology</li><li>ethical and legal work practices.</li></ul>",
            "<ul><li>participate in at least one open information sharing session with peers</li><li>investigate one or more new technologies and identify how they can affect and assist design output</li><li>identify and participate in at least one activity to maintain currency in design industry trends and practices.</li></ul>"
        ]
    },
    {
        "slug": "knowledge_evidence",
        "label": "Knowledge Evidence",
        "children": [
            "<p>The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:</p>",
            "<ul><li>relationship between design and allied industries design industry</li><li>impact of legislation, including intellectual property, on the design industry</li><li>ethical work practices in the design industry</li><li>current and emerging technologies used within the design industry</li><li>obligations of employers and employees in the design industry</li><li>key organisations that may provide advice or information about the design industry</li><li>sources of information on the design industry and ways of maintaining current industry knowledge.</li></ul>"
        ]
    },
    {
        "slug": "assessment_conditions",
        "label": "Assessment Conditions",
        "children": [
            "<p>Skills in this unit must be demonstrated in a workplace or simulated environment where the conditions are typical of those in a working environment in this industry. </p>",
            "<p>This includes access to:</p>",
            "<ul><li>sources of information on industry structure, business practices, technologies, and ethical, legal and intellectual property requirements.</li></ul>",
            "<p></p>",
            "<p>Assessors of this unit must satisfy the requirements for assessors in applicable vocational education and training legislation, frameworks and/or standards.</p>"
        ]
    }
]