[
    {
        "slug": "modification_history",
        "label": "Modification History",
        "children": [
            "<table><tr><td><p><strong>Release</strong></p></td><td><p><strong>Comments</strong></p></td></tr><tr><td><p>Release 1</p></td><td><p>This version first released with CUA Creative Arts and Culture Training Package Version 5.0.</p></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "application",
        "label": "Application",
        "children": [
            "<p>This unit describes the skills and knowledge required to explore and creatively apply the design process to the development of two-dimensional (2D) forms. It involves exploring ideas and the creative design process, and communicating different ideas through application of design processes to 2D forms.</p>",
            "<p>No licensing, legislative or certification requirements apply to this unit at the time of publication.</p>"
        ]
    },
    {
        "slug": "unit_sector",
        "label": "Unit Sector",
        "children": [
            "<p>Design – Design Process</p>"
        ]
    },
    {
        "slug": "elements_and_performance_criteria",
        "label": "Elements and Performance Criteria",
        "children": [
            "<table><tr><td><p><strong>ELEMENT</strong></p></td><td><p><strong>PERFORMANCE CRITERIA</strong></p></td></tr><tr><td><p><em>Elements describe the essential outcomes.</em></p></td><td><p><em>Performance criteria describe the performance needed to demonstrate achievement of the element.</em></p></td></tr><tr><td><p>1. Source information on 2D design</p></td><td><p>1.1 Identify and access applicable sources of information on 2D design </p><p>1.2 Evaluate and collate information on features of 2D design </p></td></tr><tr><td><p>2. Explore the creative design process for 2D forms</p></td><td><p>2.1 Generate different ideas and options for use of 2D design using creative thinking techniques</p><p>2.2 Explore and challenge different ideas using experimentation of different 2D designs</p><p>2.3 Challenge assumptions, evaluate ideas and refine approaches</p><p>2.4 Consciously change perspective, and evaluate ideas and situations in new ways</p></td></tr><tr><td><p>3. Communicate ideas through application of design processes to 2D forms</p></td><td><p>3.1 Investigate and examine how a particular idea might be communicated in 2D</p><p>3.2 Select materials, tools and equipment applicable to the realisation of idea </p><p>3.3 Apply a creative design process to produce different 2D idea realisations </p><p>3.4 Examine own application of design process and success in communicating the idea </p><p>3.5 Seek and obtain feedback from others about the 2D form and its success in communicating idea </p><p>3.6 Present and store concept realisations and work samples as required </p></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "foundation_skills",
        "label": "Foundation Skills",
        "children": [
            "<p><em>This section describes those language, literacy, numeracy and employment skills that are essential to performance but not explicit in the performance criteria.</em></p>",
            "<table><tr><td><p><strong>S</strong><strong>KILL</strong></p></td><td><p><strong>DESCRIPTION</strong></p></td></tr><tr><td><p>Reading</p></td><td><ul><li>Interprets textual information from applicable sources to determine and adhere to requirements</li></ul></td></tr><tr><td><p>Writing</p></td><td><ul><li>Produces different text types using applicable vocabulary, grammatical structure and referencing conventions </li></ul></td></tr><tr><td><p>Oral Communication</p></td><td><ul><li>Participates in verbal exchanges using vocabulary, style and tone applicable to audience </li><li>Clarifies understanding using listening techniques</li></ul></td></tr><tr><td><p>Numeracy</p></td><td><ul><li>Performs mathematical calculations to produce 2D designs</li></ul></td></tr><tr><td><p>Planning and organising</p></td><td><ul><li>Plans and organises required tasks</li></ul></td></tr><tr><td><p>Initiative and enterprise</p></td><td><ul><li>Identifies ideas in use in other contexts and considers how they might be applied in own context</li><li>Selects new ideas that may improve a process in immediate work context</li><li>Evaluates decisions on how well they meet stated goals</li></ul></td></tr><tr><td><p>Self-management</p></td><td><ul><li>Takes responsibility for routine low-impact decisions within familiar situations</li></ul></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "unit_mapping_information",
        "label": "Unit Mapping Information",
        "children": [
            "<p>Supersedes and is equivalent to BSBDES302 Explore and apply the creative design process to 2D forms.</p>"
        ]
    },
    {
        "slug": "links",
        "label": "Links",
        "children": [
            "<p>Companion Volume Implementation Guide is found on VETNet - <a>https://vetnet.gov.au/Pages/TrainingDocs.aspx?q=1db201d9-4006-4430-839f-382ef6b803d5</a></p>"
        ]
    },
    {
        "slug": "modification_history",
        "label": "Modification History",
        "children": [
            "<table><tr><td><p><strong>Release</strong></p></td><td><p><strong>Comments</strong></p></td></tr><tr><td><p>Release 1</p></td><td><p>This version first released with CUA Creative Arts and Culture Training Package Version 5.0.</p></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "performance_evidence",
        "label": "Performance Evidence",
        "children": [
            "<p>The candidate must demonstrate the ability to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including evidence of the ability to:</p>",
            "<ul><li>realise at least two different ideas using creative design processes on two-dimensional (2D) forms.</li></ul>",
            "<p></p>",
            "<p>In the course of the above, the candidate must:</p>",
            "<ul><li>apply creative thinking techniques and experimentation processes based on available resource materials</li><li>review own work and identify one or more areas for future improvements.</li></ul>"
        ]
    },
    {
        "slug": "knowledge_evidence",
        "label": "Knowledge Evidence",
        "children": [
            "<p>The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of: </p>",
            "<ul><li>creative thinking techniques that can be used as part of the design process</li><li>elements and principles of design as applied to 2D forms </li><li>materials, tools and equipment required for the design of 2D forms </li><li>ways an individual can interpret and choose ideas within the design process</li><li>common challenges that arise in the design of 2D forms.</li></ul>"
        ]
    },
    {
        "slug": "assessment_conditions",
        "label": "Assessment Conditions",
        "children": [
            "<p>Skills in this unit must be demonstrated in a workplace or simulated environment where the conditions are typical of those in a working environment in this industry. </p>",
            "<p>This includes access to:</p>",
            "<ul><li>materials, resources and equipment needed to apply design processes to 2D forms.</li></ul>",
            "<p></p>",
            "<p>Assessors of this unit must satisfy the requirements for assessors in applicable vocational education and training legislation, frameworks and/or standards.</p>"
        ]
    }
]