[
    {
        "slug": "modification_history",
        "label": "Modification History",
        "children": [
            "<table><tr><td><p><strong>Release</strong></p></td><td><p><strong>Comments</strong></p></td></tr><tr><td><p>Release 1</p></td><td><p>This version first released with CUA Creative Arts and Culture Training Package Version 5.0.</p></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "application",
        "label": "Application",
        "children": [
            "<p>This unit describes the skills and knowledge required to experiment with ideas and techniques to find an individual style or voice throughout a creative project that results in a completed work.</p>",
            "<p>The unit applies to those who have sound technical, conceptual and theoretical skills in a particular area of creative practice, often at a pre-professional level.</p>",
            "<p>No licensing, legislative or certification requirements apply to this unit at the time of publication.</p>"
        ]
    },
    {
        "slug": "unit_sector",
        "label": "Unit Sector",
        "children": [
            "<p>Industry capability – Professional Practice</p>"
        ]
    },
    {
        "slug": "elements_and_performance_criteria",
        "label": "Elements and Performance Criteria",
        "children": [
            "<table><tr><td><p><strong>ELEMENT</strong></p></td><td><p><strong>PERFORMANCE CRITERIA</strong></p></td></tr><tr><td><p><em>Elements describe the essential outcomes.</em></p></td><td><p><em>Performance criteria describe the performance needed to demonstrate achievement of the element.</em></p></td></tr><tr><td><p>1. Develop ideas for creative project</p></td><td><p>1.1 Identify and analyse sources that inform ideas for work</p><p>1.2 Explore and identify ideas using visual representation and design tools</p><p>1.3 Challenge identified ideas and engage with others as required</p><p>1.4 Identify possible project constraints based on nature and purpose of work</p><p>1.5 Refine and select options based on own analysis and communication<strong></strong>with others</p></td></tr><tr><td><p>2. Plan creative project</p></td><td><p>2.1 Confirm scope and objectives of work in consultation with required personnel as required</p><p>2.2 Organise financial, physical and other resources</p><p>2.3 Evaluate safety and sustainability considerations for project</p><p>2.4 Identify options for documenting and recording work and ideas, and associated research </p></td></tr><tr><td><p>3. Create finished work</p></td><td><p>3.1 Adapt and extend skills in manipulating selected materials, processes and technologies to fulfil project objectives</p><p>3.2 Evaluate creative work in progress and respond to conceptual and technical issues by adjusting work as required</p><p>3.3 Monitor project workflow against plan</p><p>3.4 Apply safe and sustainable work practices required for chosen creative form</p><p>3.5 Document production of work using approaches required for chosen creative form</p></td></tr><tr><td><p>4. Evaluate own work</p></td><td><p>4.1 Analyse own work in terms of conceptual development, technical execution and professional potential</p><p>4.2 Identify areas for future improvement of realising creative projects and own technical skills in chosen creative form</p><p>4.3 Evaluate efficiency and effectiveness<strong></strong>of overall work process</p><p>4.4 Seek input from others as required </p></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "foundation_skills",
        "label": "Foundation Skills",
        "children": [
            "<p><em>This section describes those language, literacy, numeracy and employment skills that are essential to performance but not explicit in the performance criteria.</em></p>",
            "<table><tr><td><p><strong>S</strong><strong>KILL</strong></p></td><td><p><strong>DESCRIPTION</strong></p></td></tr><tr><td><p>Learning</p></td><td><ul><li>Reviews own technical skills and performance and identifies areas for future development</li></ul></td></tr><tr><td><p>Numeracy</p></td><td><ul><li>Determines project costs using calculations with whole numbers and routine fractions, decimals or percentages</li><li>Selects, totals and orders required resources within project budgetary and time constraints</li></ul></td></tr><tr><td><p>Oral communication</p></td><td><ul><li>Discusses ideas regarding conceptual and technical issues in creative work using required language </li><li>Discusses scope and objectives of work using listening and questioning skills with required personnel</li></ul></td></tr><tr><td><p>Reading</p></td><td><ul><li>Interprets complex or abstract information in different forms</li></ul></td></tr><tr><td><p>Writing</p></td><td><ul><li>Conveys explicit processes, requirements and ideas for intended audience using clear and detailed language </li></ul></td></tr><tr><td><p>Initiative and enterprise</p></td><td><ul><li>Identifies, evaluates and follows explicit responsibilities throughout project</li><li>Experiments with different techniques and tools when developing work </li><li>Recognises and addresses challenges and opportunities for improving work</li><li>Contributes to decision making process when required and takes responsibility for outcomes </li><li>Evaluates effectiveness of decisions according to stated goals</li></ul></td></tr><tr><td><p>Planning and organising</p></td><td><ul><li>Plans and organises methodologies and resource requirements according to creative vision</li></ul></td></tr><tr><td><p>Problem solving</p></td><td><ul><li>Evaluates possibilities and methodologies using knowledge gained</li></ul></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "unit_mapping_information",
        "label": "Unit Mapping Information",
        "children": [
            "<p>Supersedes and is equivalent to CUAPPR401 Realise a creative project.</p>"
        ]
    },
    {
        "slug": "links",
        "label": "Links",
        "children": [
            "<p>Companion Volume Implementation Guide is found on VETNet - <a>https://vetnet.gov.au/Pages/TrainingDocs.aspx?q=1db201d9-4006-4430-839f-382ef6b803d5</a></p>"
        ]
    },
    {
        "slug": "modification_history",
        "label": "Modification History",
        "children": [
            "<table><tr><td><p><strong>Release</strong></p></td><td><p><strong>Comments</strong></p></td></tr><tr><td><p>Release 1</p></td><td><p>This version first released with CUA Creative Arts and Culture Training Package Version 5.0.</p></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "performance_evidence",
        "label": "Performance Evidence",
        "children": [
            "<p>The candidate must demonstrate the ability to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including evidence of the ability to:</p>",
            "<ul><li>produce at least two creative works that reflects emerging individual style, using safe and sustainable work practices.</li></ul>",
            "<p></p>",
            "<p>In the course of the above, the candidate must:</p>",
            "<ul><li>develop a plan for producing the creative works</li><li>develop and refine conceptual and technical skills through demonstrated process of exploration and experimentation</li><li>document creative work in format required for chosen form</li><li>communicate effectively with others about ideas and created work, integrating constructive feedback</li><li>evaluate efficiency and effectiveness of completed creative project process.</li></ul>"
        ]
    },
    {
        "slug": "knowledge_evidence",
        "label": "Knowledge Evidence",
        "children": [
            "<p>The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:</p>",
            "<ul><li>relationship between technique, materials and process in chosen creative form</li><li>typical problems that occur in developing creative projects, and how to avoid or resolve them</li><li>commonly used research methodologies for creative practitioners</li><li>current and emerging practices for documenting work in creative context</li><li>basic project management techniques, particularly in relation to work planning, time management and resource management</li><li>intellectual property issues and legislation associated with professional creative practice</li><li>sustainability issues associated with tools and materials used in chosen creative form</li><li>work health and safety requirements in relation to chosen creative form.</li></ul>"
        ]
    },
    {
        "slug": "assessment_conditions",
        "label": "Assessment Conditions",
        "children": [
            "<p>Skills in this unit must be demonstrated in a workplace or simulated environment where the conditions are typical of those in a working environment in this industry. </p>",
            "<p>This includes access to:</p>",
            "<ul><li>resources for producing creative work, including work space, tools, equipment and materials</li><li>studio and workshop facilities.</li></ul>",
            "<p></p>",
            "<p>Assessors of this unit must satisfy the requirements for assessors in applicable vocational educational and training legislation, frameworks and/or standards.</p>"
        ]
    }
]