[
    {
        "slug": "modification_history",
        "label": "Modification History",
        "children": [
            "<table><tr><td><p><strong>Release</strong></p></td><td><p><strong>Comments</strong></p></td></tr><tr><td><p>Release 1</p></td><td><p>This version first released with CUA Creative Arts and Culture Training Package Version 5.0.</p></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "application",
        "label": "Application",
        "children": [
            "<p>This unit describes the skills and knowledge required to apply work health and safety (WHS) requirements, including implementing safe work practices, participating in risk assessment and control, and following emergency procedures in the creative industries.</p>",
            "<p>The unit applies to those who are required to identify their individual WHS responsibilities and implement procedures to work safely in creative industry work contexts.</p>",
            "<p>No licensing, legislative or certification requirements apply to this unit at the time of publication.</p>"
        ]
    },
    {
        "slug": "unit_sector",
        "label": "Unit Sector",
        "children": [
            "<p>Regulation, licensing and risk – Work health and safety</p>"
        ]
    },
    {
        "slug": "elements_and_performance_criteria",
        "label": "Elements and Performance Criteria",
        "children": [
            "<table><tr><td><p><strong>ELEMENT</strong></p></td><td><p><strong>PERFORMANCE CRITERIA</strong></p></td></tr><tr><td><p><em>Elements describe the essential outcomes.</em></p></td><td><p><em>Performance criteria describe the performance needed to demonstrate achievement of the element.</em></p></td></tr><tr><td><p>1. Implement safe work practices</p></td><td><p>1.1 Develop and maintain own knowledge of WHS legislation, codes of practice and workplace policies and procedures</p><p>1.2 Apply legislative requirements, safety documentation and signage to work tasks</p><p>1.3 Comply with duty of care requirements relevant to work tasks</p><p>1.4 Use personal protective equipment and other measures as required to prevent injury or impairment</p><p>1.5 Use tools, equipment and materials according to safe work practices</p><p>1.6 Participate in WHS consultative activities</p></td></tr><tr><td><p>2. Participate in hazard identification and risk assessment and control</p></td><td><p>2.1 Identify and report hazards or WHS issues in the workplace to required personnel</p><p>2.2 Assess and control risks in line with workplace procedures</p><p>2.3 Document risk control actions as required according to workplace procedures</p><p>2.4 Contribute to reporting workplace WHS, hazard, accident and incident reports as required</p></td></tr><tr><td><p>3. Follow emergency procedures</p></td><td><p>3.1 Report emergencies and incidents promptly to required personnel or authorities according to workplace procedures</p><p>3.2 Respond to emergencies in line with own level of responsibility</p><p>3.3 Implement evacuation procedures as required</p></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "foundation_skills",
        "label": "Foundation Skills",
        "children": [
            "<p><em>This section describes those language, literacy, numeracy and employment skills that are essential to performance but not explicit in the performance criteria.</em></p>",
            "<table><tr><td><p><strong>SKILL</strong></p></td><td><p><strong>DESCRIPTION</strong></p></td></tr><tr><td><p>Oral Communication</p></td><td><ul><li>Uses clear and direct words to relay information to others</li><li>Uses questioning and listening techniques to identify and clarity requirements</li></ul></td></tr><tr><td><p>Reading</p></td><td><ul><li>Interprets textual information from a range of sources</li></ul></td></tr><tr><td><p>Writing</p></td><td><ul><li>Completes workplace documentation according to requirements</li></ul></td></tr><tr><td><p>Initiative and enterprise</p></td><td><ul><li>Assesses situations to decide on action required</li></ul></td></tr><tr><td><p>Planning and organising</p></td><td><ul><li>Plans and completes a range of routine tasks in logical order</li></ul></td></tr><tr><td><p>Self-management</p></td><td><ul><li>Understands and complies with legislative and organisational requirements</li><li>Understands own WHS responsibilities</li></ul></td></tr><tr><td><p>Teamwork</p></td><td><ul><li>Works collaboratively with colleagues to keep workplace safe </li></ul></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "unit_mapping_information",
        "label": "Unit Mapping Information",
        "children": [
            "<p>Supersedes and is equivalent to CUAWHS302 Apply work health and safety practices.</p>"
        ]
    },
    {
        "slug": "links",
        "label": "Links",
        "children": [
            "<p>Companion Volume Implementation Guide is found on VETNet - <a>https://vetnet.gov.au/Pages/TrainingDocs.aspx?q=1db201d9-4006-4430-839f-382ef6b803d5</a></p>"
        ]
    },
    {
        "slug": "modification_history",
        "label": "Modification History",
        "children": [
            "<table><tr><td><p><strong>Release</strong></p></td><td><p><strong>Comments</strong></p></td></tr><tr><td><p>Release 1</p></td><td><p>This version first released with CUA Creative Arts and Culture Training Package Version 5.0.</p></td></tr></table>",
            "<p></p>"
        ]
    },
    {
        "slug": "performance_evidence",
        "label": "Performance Evidence",
        "children": [
            "<p>The candidate must demonstrate the ability to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including evidence of the ability to:</p>",
            "<ul><li>apply work health and safety (WHS) practices on at least three occasions, including:</li></ul>",
            "<ul><li>completing work tasks according to WHS legislative and workplace requirements, including:</li></ul>",
            "<ul><li>using personal protective equipment (PPE)</li><li>following safety signs and symbols</li><li>communicating WHS issues to required personnel</li></ul>",
            "<ul><li>identifying and reporting risks to physical and mental wellbeing</li><li>assessing and controlling risks and documenting risk control measures </li><li>following procedures for responding to incidents and emergencies.</li></ul>"
        ]
    },
    {
        "slug": "knowledge_evidence",
        "label": "Knowledge Evidence",
        "children": [
            "<p>The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:</p>",
            "<ul><li>WHS rights and responsibilities as they apply to own role </li><li>duty of care requirements relevant to own role</li><li>typical workplace health and safety roles</li><li>common safety signs and symbols</li><li>procedures for reporting hazards, risks, incidents and accidents</li><li>common hazards and major causes of accidents in workplace</li><li>common risks to physical and mental wellbeing of self and others in the workplace</li><li>risk control procedures relevant to own role</li><li>evacuation procedures</li><li>potential emergency situations and response procedures.</li></ul>"
        ]
    },
    {
        "slug": "assessment_conditions",
        "label": "Assessment Conditions",
        "children": [
            "<p>Skills in this unit must be demonstrated in a workplace or simulated environment where the conditions are typical of those in a working environment in this industry. </p>",
            "<p>This includes access to:</p>",
            "<ul><li>workplace instructions and information relating to safe work practices </li><li>case studies and, where possible, real situations</li><li>interaction with others required to demonstrate the performance evidence.</li></ul>",
            "<p></p>",
            "<p>Assessors of this unit must satisfy the requirements for assessors in applicable vocational educational and training legislation, frameworks and/or standards.</p>"
        ]
    }
]